const adjectives = [
  '작은', '예쁜', '귀여운', '깜찍한', '밝은', '따뜻한', '부드러운', '몽실한', '맑은', '푸른',
  '환한', '순한', '고운', '착한', '빠른', '짧은', '깊은', '달콤한', '쫀득한', '시원한',
  '새콤한', '말랑한', '아린', '은은한', '포근한', '뽀얀', '하얀', '짙은', '여린',
  '얇은', '둥근', '노란', '붉은', '까만', '졸린', '살랑한', '상큼한', '싱그러운',
  '다정한', '가뿐한', '수줍은', '상냥한', '반짝이는', '촉촉한', '초록한', '단단한',
  '따스한', '새침한', '오목한', '탱글한', '보송한', '차분한', '단아한', '잔잔한', '고요한', '도톰한',
  '앳된', '포동한', '싱싱한', '고소한', '향기로운', '짭짤한', '느긋한',
  '아늑한', '깨끗한', '쾌활한', '몽환적인', '황홀한', '발랄한', '다소곳한', '조용한', '쨍한', '바삭한',
  '부푼', '탱탱한', '뽀송뽀송한', '산뜻한', '비단같은', '말똥한', '살가운', '유쾌한', '알록달록한',
  '꽃다운', '초롱한', '뭉클한', '배시시한', '뽀글뽀글한', '포슬포슬한', '햇살같은',
  '산들한', '별빛같은', '방긋한', '쫑긋한', '청순한', '빛나는', '포근포근한', '몽글몽글한', '들뜬', '솜사탕같은',
  '활짝한', '나긋나긋한', '샛노란', '말짱한', '달큰한', '오도독한', '바람같은', '청아한', '폭신한',
  '아삭한', '새싹같은', '흐뭇한', '봄날같은', '뽀드득한', '다정다감한', '활기찬', '뽀얗게', '다채로운', '너그러운',
  '잔잔한', '꼬마같은', '어여쁜', '복스러운', '다부진', '발그레한', '빛바랜', '앙증맞은', '몽환적인', '달빛같은',
  '비옥한', '햇살가득한', '잔망스러운', '총명한', '방울같은', '발랄한', '솜털같은', '다사로운'
];




const nouns = [
  '마리오', '루이지', '피치공주', '요시', '토드', '쿠파', '데이지공주', '와리오', '와루이지', '돈키콩',
  '디디콩', '크랭키콩', '벨져주니어', '티모', '코르크', '피디프라나', '젤다공주', '링크',
  '가논돌프', '임파', '시크', '나비', '에포나', '마린', '잉클링', '캡틴팔콘', '폭시',
  '커비', '디디디대왕', '나이트로', '사무스아란', '리들리', '니스', '루카스', '크로마', '로빈',
  '마르스', '로이', '이크', '리자몽', '피카츄', '이브이', '푸린', '꼬부기', '뮤츠',
  '루카리오', '메타몽', '레지기라스', '키르히', '카쿠쿠루', '타미야', '빨간팬더', '아기팬더', '코알라',
  '너구리', '토끼', '햄스터', '다람쥐', '고양이', '강아지', '알파카', '앵무새', '기니피그',
  '꼬마', '너구리촌장', '유카리', '리사', '아뇨나', '톰토드', '라이온킹', '푸바', '푸우',
  '테리어몬', '스머프 파파', '피글렛', '버디', '제이디', '젤리', '리틀베어', '푸들리',
  '곰돌이', '코비코', '치코리타', '무로링', '메리', '아카', '바니', '올빼미', '팡고',
  '체리', '페퍼', '리틀토이', '흰강아지', '냥코', '망고', '코코', '고슴도치', '물범', '돌고래',
  '킹펭귄', '타라', '발리', '체스', '미루', '도토리', '샌디', '아가', '슈가', '페트라',
  '버블', '트위티', '주디', '마블', '쵸비', '피치', '보리', '젬마', '모카', '프라다',
  '루비', '베리', '쿠로미', '라라', '치와와', '파이퍼'
];


// size 가 2 의 제곱일때 가능! bitwise 를 이용해서 부동소수점 연산을 하지 않음.
function getRandomIntBitwise(size: number) {
  return Math.floor(Math.random() * size); // 0부터 15까지의 정수
}

function getRandomAdjective() {
  return adjectives[getRandomIntBitwise(adjectives.length)];
}

function getRandomNoun(){
  // return '창현';
  return nouns[getRandomIntBitwise(nouns.length)];
}

function getRandomBrightColor(): string {
  const hue = Math.floor(Math.random() * 360);
  const saturation = Math.floor(Math.random() * 50) + 50;
  const lightness = Math.floor(Math.random() * 30) + 50;

  return `hsl(${hue}, ${saturation}%, ${lightness}%)`;
}

export { getRandomAdjective, getRandomNoun, getRandomBrightColor };
